# 2018年计划

## pmp认证考试

完成pmp考试, 总结学习经验.
坚持上课,完成模拟考试

## 在职研究生课程考试
坚持每节课都去上,完成每节课的课程作业.
结实更多同学

## 书籍阅读

完成技术书籍阅读,学习

<<深入理解java虚拟机>>(第二版) -- 周志明
<<java性能权威指南>> -- 臧秀涛
<<实战java高并发程序设计>> -- 葛一鸣
<<java并发编程艺术>>
<<java并发编程实战>>
<<微服务设计>>
<<领域驱动设计>>
<<分布式服务框架原理与实践>>
<<大型网站系统与java中间件实践>>
<<rabbitMQ实战>>
<<架构即未来>>
<<大型网站技术架构>>
<<亿级流量网站架构核心技术>>

了解领域
算法相关,协议相关,linux相关,大数据相关,机器学习相关

软技能:

管理类书籍整理五本+
产品公司格局类书籍整理五本+

个人素养类书籍
文学小说整理五本+ //TODO
金融经济类书籍整理五本+ //TODO

## 笔记记录

每周坚持公众号整理出至少2篇笔记,同比印象笔记,个人博客
个人年度指标: 至少整理60篇笔记(包含技术+个人感悟)


